app/controllers/user_controller.rb

  def create
    @user = User.new(params[:user])
    @user.save
---
INSERT INTO "users" ("created_at", "updated_at", "username", "last_name", "confirmation_token", "password", "email", "first_name") VALUES('2011-04-25 06:44:58', '2011-04-25 06:44:58', 'h', 'h', NULL, 'h', 'h', 'h')